AVSystem/Anjay-freertos-client/Drivers/BSP/B-L462E-CELL1/stm32l462e_cell1_motion_sensors.c
/**
  ******************************************************************************
  * @file    stm32l462e_cell1_motion_sensors.c
  * @author  MCD Application Team
  * @brief   source file for the BSP motion sensors driver
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l462e_cell1_motion_sensors.h"

/** @addtogroup BSP BSP
  * @{
  */

/** @addtogroup STM32L462E_CELL1 STM32L462E_CELL1
  * @{
  */

/** @addtogroup STM32L462E_CELL1_MOTION_SENSORS STM32L462E_CELL1 MOTION_SENSORS
  * @{
  */

/** @defgroup STM32L462E_CELL1_MOTION_SENSORS_Exported_Variables STM32L462E_CELL1 MOTION_SENSORS Exported Variables
  * @{
  */

extern void
*MotionCompObj[STM32L462E_CELL1_MOTION_INSTANCES_NBR]; /* This "redundant" line is here for MISRA C-2012 rule 8.4 */
void *MotionCompObj[STM32L462E_CELL1_MOTION_INSTANCES_NBR];

/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_MOTION_SENSORS_Private_Variables STM32L462E_CELL1 MOTION_SENSORS Private Variables
  * @{
  */

/* We define a jump table in order to get the correct index from the desired function. */
/* This table should have a size equal to the maximum value of a function plus 1.      */
static uint32_t FunctionIndexMotion[5] = {0, 0, 1, 1, 2};
static MOTION_SENSOR_FuncDrv_t
*MotionFuncDrv[STM32L462E_CELL1_MOTION_INSTANCES_NBR][STM32L462E_CELL1_MOTION_FUNCTIONS_NBR];
static MOTION_SENSOR_CommonDrv_t *MotionDrv[STM32L462E_CELL1_MOTION_INSTANCES_NBR];
static MOTION_SENSOR_Ctx_t MotionCtx[STM32L462E_CELL1_MOTION_INSTANCES_NBR];

/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_MOTION_SENSORS_Private_Functions_Prototypes  MOTION_SENSORS Private Functions Protos
  * @{
  */

#if (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_ACC_0 == 1)
static int32_t LSM303AGR_ACC_0_Probe(uint32_t Functions);
#endif /* (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_ACC_0 == 1) */

#if (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_MAG_0 == 1)
static int32_t LSM303AGR_MAG_0_Probe(uint32_t Functions);
#endif /* (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_MAG_0 == 1) */

/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_MOTION_SENSORS_Exported_Functions STM32L462E_CELL1 MOTION_SENSORS Exported Functions
  * @{
  */


/**
  * @brief  Initializes the Accelerator motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_Init_Acc(void)
{
  return (BSP_MOTION_SENSOR_Init(STM32L462E_CELL1_LSM303AGR_ACC_0, MOTION_ACCELERO));
}

/**
  * @brief  Initializes the Magnetometer motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_Init_Mag(void)
{
  return (BSP_MOTION_SENSOR_Init(STM32L462E_CELL1_LSM303AGR_MAG_0, MOTION_MAGNETO));
}

/**
  * @brief  Deinitializes the Accelerator motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_DeInit_Acc(void)
{
  return (BSP_MOTION_SENSOR_DeInit(STM32L462E_CELL1_LSM303AGR_ACC_0));
}

/**
  * @brief  Deinitializes the Magnetometer motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_DeInit_Mag(void)
{
  return (BSP_MOTION_SENSOR_DeInit(STM32L462E_CELL1_LSM303AGR_MAG_0));
}

/**
  * @brief  Read the acceleration motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @param  acceleration pointer to acceleration value
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_Read_Acc(MOTION_SENSOR_Axes_t *acceleration)
{
  return (BSP_MOTION_SENSOR_GetAxes(STM32L462E_CELL1_LSM303AGR_ACC_0, MOTION_ACCELERO, acceleration));
}

/**
  * @brief  Read the magnetometer motion sensor
  * @note   This is a  part of High-Level API to ease use of sensors.
  * @param  magnetic_field pointer to magnetic_field value
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_Read_Mag(MOTION_SENSOR_Axes_t *magnetic_field)
{
  return (BSP_MOTION_SENSOR_GetAxes(STM32L462E_CELL1_LSM303AGR_MAG_0, MOTION_MAGNETO, magnetic_field));
}

/**
  * @brief  Initializes the motion sensors
  * @param  Instance Motion sensor instance
  * @param  Functions Motion sensor functions. Could be :
  *         - MOTION_GYRO and/or MOTION_ACCELERO for instance 0
  *         - MOTION_ACCELERO for instance 1
  *         - MOTION_MAGNETO for instance 2
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_Init(uint32_t Instance, uint32_t Functions)
{
  int32_t ret = BSP_ERROR_NONE;
  uint32_t function = MOTION_GYRO;
  uint32_t i;
  uint32_t component_functions = 0;
  MOTION_SENSOR_Capabilities_t cap;

  switch (Instance)
  {

#if (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_ACC_0 == 1)
    case STM32L462E_CELL1_LSM303AGR_ACC_0:
      if (LSM303AGR_ACC_0_Probe(Functions) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_NO_INIT;
      }
      else
      {
        if (MotionDrv[Instance]->GetCapabilities(MotionCompObj[Instance], (void *)&cap) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_UNKNOWN_COMPONENT;
        }
        else
        {
          if (cap.Acc == 1U)
          {
            component_functions |= MOTION_ACCELERO;
          }
          if (cap.Gyro == 1U)
          {
            component_functions |= MOTION_GYRO;
          }
          if (cap.Magneto == 1U)
          {
            component_functions |= MOTION_MAGNETO;
          }
        }
      }
      break;
#endif /* (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_ACC_0 == 1) */

#if (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_MAG_0 == 1)
    case STM32L462E_CELL1_LSM303AGR_MAG_0:
      if (LSM303AGR_MAG_0_Probe(Functions) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_NO_INIT;
      }
      else
      {
        if (MotionDrv[Instance]->GetCapabilities(MotionCompObj[Instance], (void *)&cap) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_UNKNOWN_COMPONENT;
        }
        else
        {
          if (cap.Acc == 1U)
          {
            component_functions |= MOTION_ACCELERO;
          }
          if (cap.Gyro == 1U)
          {
            component_functions |= MOTION_GYRO;
          }
          if (cap.Magneto == 1U)
          {
            component_functions |= MOTION_MAGNETO;
          }
        }
      }
      break;
#endif /* (USE_STM32L462E_CELL1_MOTION_SENSOR_LSM303AGR_MAG_0 == 1) */

    default:
      ret = BSP_ERROR_WRONG_PARAM;
      break;
  }

  if (ret == BSP_ERROR_NONE)
  {
    for (i = 0; i < STM32L462E_CELL1_MOTION_FUNCTIONS_NBR; i++)
    {
      if (((Functions & function) == function) && ((component_functions & function) == function))
      {
        /* protection to not exceed FunctionIndexMotion array size */
        if (function <= 4U)
        {
          if (MotionFuncDrv[Instance][FunctionIndexMotion[function]]->Enable(MotionCompObj[Instance]) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
            break;
          }
        }
      }
      function = function << 1;
    }
  }

  return ret;
}

/**
  * @brief  Deinitialize Motion sensor
  * @param  Instance Motion sensor instance
  * @retval BSP status
  */
int32_t BSP_MOTION_SENSOR_DeInit(uint32_t Instance)
{
  int32_t ret;

